---
type: CurtainGridSet
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# CurtainGridSet

`Autodesk.Revit.DB.CurtainGridSet` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | CurtainGridSet | — | `public CurtainGridSet ()` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | Contains | — | `public virtual bool Contains ( CurtainGrid item )` |
| Method | Erase | — | `public virtual int Erase ( CurtainGrid item )` |
| Method | ForwardIterator | — | `public virtual CurtainGridSetIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual bool Insert ( CurtainGrid item )` |
| Method | ReverseIterator | — | `public virtual CurtainGridSetIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |